### Q.4 Creating a Pandas dataframe using list of tuples

In [1]:
import pandas as pd

In [2]:
# creating  list of tuples

data = [('Mahi', 7, 34),
        ('Pant', 17, 26),
        ('Rohit', 45, 28),
        ('Hardik', 18, 17),
        ('Shardul', 47, 15) ]

In [3]:
df = pd.DataFrame(data, columns = ['Name', 'No', 'age' ])

In [4]:
df

      Name  No  age
0     Mahi   7   34
1     Pant  17   26
2    Rohit  45   28
3   Hardik  18   17
4  Shardul  47   15